#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t
#+OPTIONS: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t
#+OPTIONS: tex:t timestamp:t title:t toc:nil todo:t |:t
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.3.1 (Org mode 8.3.4)

# #+ATTR_LATEX: :align |r|Ec|rcl|
# | Domain               |  mean | error | \rb{$[f,\ffo,\ro]$} |       | \rb{$[f,\ffo,\ro]$} |     |
# |----------------------+-------+-------+---------------------+-------+---------------------+-----|
# | IPC benchmark (1104) | 564.3 |   1.5 | 564.3 $\pm$ 1.5     | 564.3 | $\pm$               | 1.5 |
# |----------------------+-------+-------+---------------------+-------+---------------------+-----|
# | airport(50)          |    25 |     0 | 25 $\pm$ 0          |    25 | $\pm$               |   0 |


#+ATTR_LATEX: :align |r|cccHHH|cccHHH|cccHHH|cccHHHHHHHHH|
| Domain                   | \rb{$[f,h,\hh,\depth,\fifo]$} | \rb{$[f,h,\hh,\depth,\lifo]$} | \rb{$[f,h,\hh,\depth,\ro]$} |   R |   R |   R | \rb{$[f,\hh,\depth,\fifo]$} | \rb{$[f,\hh,\depth,\lifo]$} | \rb{$[f,\hh,\depth,\ro]$} |   R |   R |   R | \rb{$[f,\ffo,\fifo]$} | \rb{$[f,\ffo,\lifo]$} | \rb{$[f,\ffo,\ro]$} |   R |   R |   R | \rb{$[f,\ffo,\depth,\fifo]$} | \rb{$[f,\ffo,\depth,\lifo]$} | \rb{$[f,\ffo,\depth,\ro]$} |   R |   R |   R | \rb{$[f,\gco,\fifo]$} | \rb{$[f,\gco,\lifo]$} | \rb{$[f,\gco,\ro]$} |   R |   R |   R |
|--------------------------+-------------------------------+-------------------------------+-----------------------------+-----+-----+-----+-----------------------------+-----------------------------+---------------------------+-----+-----+-----+-----------------------+-----------------------+---------------------+-----+-----+-----+------------------------------+------------------------------+----------------------------+-----+-----+-----+-----------------------+-----------------------+---------------------+-----+-----+-----|
| IPC benchmark (1104)     |                           536 |                           535 | 534.7 $\pm$ 2.1             | 537 | 533 | 534 |                         534 |                         534 | 534.7 $\pm$ 1.5           | 536 | 533 | 535 |                   564 |                   562 | 564.3 $\pm$ 1.5     | 563 | 564 | 566 |                          563 |                          560 | 563.3 $\pm$ 1.5            | 562 | 563 | 565 |                   558 |                   566 | 560.7 $\pm$ 0.6     | 561 | 560 | 561 |
|--------------------------+-------------------------------+-------------------------------+-----------------------------+-----+-----+-----+-----------------------------+-----------------------------+---------------------------+-----+-----+-----+-----------------------+-----------------------+---------------------+-----+-----+-----+------------------------------+------------------------------+----------------------------+-----+-----+-----+-----------------------+-----------------------+---------------------+-----+-----+-----|
| airport(50)              |                            24 |                            24 | 24 $\pm$ 0                  |  24 |  24 |  24 |                          24 |                          25 | 24 $\pm$ 0                |  24 |  24 |  24 |                    25 |                    24 | 25 $\pm$ 0          |  25 |  25 |  25 |                           25 |                           24 | 24.7 $\pm$ 0.6             |  25 |  24 |  25 |                    23 |                    26 | 24 $\pm$ 1          |  23 |  24 |  25 |
| barman-opt11(20)         |                             0 |                             0 | 0 $\pm$ 0                   |   0 |   0 |   0 |                           0 |                           0 | 0 $\pm$ 0                 |   0 |   0 |   0 |                     0 |                     0 | 0 $\pm$ 0           |   0 |   0 |   0 |                            0 |                            0 | 0 $\pm$ 0                  |   0 |   0 |   0 |                     0 |                     0 | 0 $\pm$ 0           |   0 |   0 |   0 |
| blocks(35)               |                            27 |                            27 | 27 $\pm$ 0                  |  27 |  27 |  27 |                          27 |                          27 | 27 $\pm$ 0                |  27 |  27 |  27 |                    27 |                    27 | 27 $\pm$ 0          |  27 |  27 |  27 |                           27 |                           27 | 27 $\pm$ 0                 |  27 |  27 |  27 |                    28 |                    28 | 28 $\pm$ 0          |  28 |  28 |  28 |
| *cybersec(19)*           |                             6 |                             4 | 5 $\pm$ 1                   |   6 |   4 |   5 |                           5 |                           3 | 5.7 $\pm$ 1.2             |   7 |   5 |   5 |                     6 |                     6 | 5.3 $\pm$ 0.6       |   5 |   5 |   6 |                            6 |                            5 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     0 |                     1 | 0.7 $\pm$ 0.6       |   1 |   1 |   0 |
| depot(22)                |                             5 |                             5 | 5 $\pm$ 0                   |   5 |   5 |   5 |                           5 |                           5 | 5 $\pm$ 0                 |   5 |   5 |   5 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |                            6 |                            6 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |
| driverlog(20)            |                            12 |                            12 | 12 $\pm$ 0                  |  12 |  12 |  12 |                          12 |                          12 | 12 $\pm$ 0                |  12 |  12 |  12 |                    13 |                    13 | 13 $\pm$ 0          |  13 |  13 |  13 |                           13 |                           13 | 13 $\pm$ 0                 |  13 |  13 |  13 |                    13 |                    13 | 13 $\pm$ 0          |  13 |  13 |  13 |
| elevators-opt11(20)      |                            12 |                            12 | 12 $\pm$ 0                  |  12 |  12 |  12 |                          12 |                          12 | 12 $\pm$ 0                |  12 |  12 |  12 |                    15 |                    15 | 15 $\pm$ 0          |  15 |  15 |  15 |                           14 |                           15 | 14 $\pm$ 0                 |  14 |  14 |  14 |                    15 |                    15 | 15 $\pm$ 0          |  15 |  15 |  15 |
| floortile-opt11(20)      |                             6 |                             6 | 6 $\pm$ 0                   |   6 |   6 |   6 |                           6 |                           6 | 6 $\pm$ 0                 |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |                            6 |                            6 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |
| freecell(80)             |                             8 |                             8 | 8 $\pm$ 0                   |   8 |   8 |   8 |                           8 |                           8 | 8 $\pm$ 0                 |   8 |   8 |   8 |                     9 |                     9 | 9 $\pm$ 0           |   9 |   9 |   9 |                            9 |                            9 | 9 $\pm$ 0                  |   9 |   9 |   9 |                     9 |                     9 | 9 $\pm$ 0           |   9 |   9 |   9 |
| grid(5)                  |                             1 |                             1 | 1 $\pm$ 0                   |   1 |   1 |   1 |                           1 |                           1 | 1 $\pm$ 0                 |   1 |   1 |   1 |                     1 |                     1 | 1 $\pm$ 0           |   1 |   1 |   1 |                            1 |                            1 | 1 $\pm$ 0                  |   1 |   1 |   1 |                     1 |                     1 | 1 $\pm$ 0           |   1 |   1 |   1 |
| gripper(20)              |                             6 |                             6 | 6 $\pm$ 0                   |   6 |   6 |   6 |                           6 |                           6 | 6 $\pm$ 0                 |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |                            6 |                            6 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |
| hanoi(30)                |                            11 |                            11 | 11 $\pm$ 0                  |  11 |  11 |  11 |                          11 |                          11 | 11 $\pm$ 0                |  11 |  11 |  11 |                    12 |                    12 | 12 $\pm$ 0          |  12 |  12 |  12 |                           12 |                           12 | 12 $\pm$ 0                 |  12 |  12 |  12 |                    12 |                    12 | 12 $\pm$ 0          |  12 |  12 |  12 |
| logistics00(28)          |                            17 |                            17 | 17 $\pm$ 0                  |  17 |  17 |  17 |                          17 |                          17 | 17 $\pm$ 0                |  17 |  17 |  17 |                    20 |                    20 | 20 $\pm$ 0          |  20 |  20 |  20 |                           20 |                           20 | 20 $\pm$ 0                 |  20 |  20 |  20 |                    20 |                    20 | 20 $\pm$ 0          |  20 |  20 |  20 |
| miconic(150)             |                           140 |                           140 | 140 $\pm$ 0                 | 140 | 140 | 140 |                         140 |                         140 | 140 $\pm$ 0               | 140 | 140 | 140 |                   140 |                   140 | 140 $\pm$ 0         | 140 | 140 | 140 |                          140 |                          140 | 140 $\pm$ 0                | 140 | 140 | 140 |                   140 |                   140 | 140 $\pm$ 0         | 140 | 140 | 140 |
| mprime(35)               |                            20 |                            21 | 20.3 $\pm$ 0.6              |  21 |  20 |  20 |                          20 |                          21 | 20.3 $\pm$ 0.6            |  21 |  20 |  20 |                    22 |                    22 | 22 $\pm$ 0          |  22 |  22 |  22 |                           22 |                           22 | 22 $\pm$ 0                 |  22 |  22 |  22 |                    20 |                    22 | 20.3 $\pm$ 0.6      |  21 |  20 |  20 |
| mystery(30)              |                            15 |                            15 | 15 $\pm$ 0                  |  15 |  15 |  15 |                          15 |                          15 | 15 $\pm$ 0                |  15 |  15 |  15 |                    16 |                    16 | 16 $\pm$ 0          |  16 |  16 |  16 |                           16 |                           16 | 16 $\pm$ 0                 |  16 |  16 |  16 |                    15 |                    16 | 15 $\pm$ 0          |  15 |  15 |  15 |
| nomystery-opt11(20)      |                            13 |                            13 | 13 $\pm$ 0                  |  13 |  13 |  13 |                          13 |                          13 | 13 $\pm$ 0                |  13 |  13 |  13 |                    14 |                    14 | 14 $\pm$ 0          |  14 |  14 |  14 |                           14 |                           14 | 14 $\pm$ 0                 |  14 |  14 |  14 |                    14 |                    14 | 14 $\pm$ 0          |  14 |  14 |  14 |
| *openstacks-opt11(20)*   |                            10 |                            10 | 10 $\pm$ 0                  |  10 |  10 |  10 |                          10 |                          10 | 10 $\pm$ 0                |  10 |  10 |  10 |                    17 |                    17 | 17 $\pm$ 0          |  17 |  17 |  17 |                           17 |                           17 | 17 $\pm$ 0                 |  17 |  17 |  17 |                    18 |                    18 | 18 $\pm$ 0          |  18 |  18 |  18 |
| parcprinter-opt11(20)    |                            13 |                            13 | 13 $\pm$ 0                  |  13 |  13 |  13 |                          13 |                          13 | 13 $\pm$ 0                |  13 |  13 |  13 |                    13 |                    13 | 13 $\pm$ 0          |  13 |  13 |  13 |                           13 |                           13 | 13 $\pm$ 0                 |  13 |  13 |  13 |                    13 |                    13 | 13 $\pm$ 0          |  13 |  13 |  13 |
| parking-opt11(20)        |                             1 |                             1 | 1 $\pm$ 0                   |   1 |   1 |   1 |                           1 |                           1 | 1 $\pm$ 0                 |   1 |   1 |   1 |                     1 |                     1 | 1 $\pm$ 0           |   1 |   1 |   1 |                            1 |                            1 | 1 $\pm$ 0                  |   1 |   1 |   1 |                     1 |                     1 | 1 $\pm$ 0           |   1 |   1 |   1 |
| pathways(30)             |                             5 |                             5 | 5 $\pm$ 0                   |   5 |   5 |   5 |                           5 |                           5 | 5 $\pm$ 0                 |   5 |   5 |   5 |                     5 |                     5 | 5 $\pm$ 0           |   5 |   5 |   5 |                            5 |                            5 | 5 $\pm$ 0                  |   5 |   5 |   5 |                     5 |                     5 | 5 $\pm$ 0           |   5 |   5 |   5 |
| pegsol-opt11(20)         |                            16 |                            16 | 16 $\pm$ 0                  |  16 |  16 |  16 |                          16 |                          16 | 16 $\pm$ 0                |  16 |  16 |  16 |                    17 |                    17 | 17 $\pm$ 0          |  17 |  17 |  17 |                           17 |                           17 | 17 $\pm$ 0                 |  17 |  17 |  17 |                    17 |                    17 | 17 $\pm$ 0          |  17 |  17 |  17 |
| pipesworld-notankage(50) |                            12 |                            12 | 12 $\pm$ 0                  |  12 |  12 |  12 |                          12 |                          12 | 12 $\pm$ 0                |  12 |  12 |  12 |                    13 |                    13 | 13 $\pm$ 0          |  13 |  13 |  13 |                           13 |                           13 | 13 $\pm$ 0                 |  13 |  13 |  13 |                    14 |                    15 | 14.7 $\pm$ 0.6      |  15 |  14 |  15 |
| pipesworld-tankage(50)   |                             7 |                             7 | 7 $\pm$ 0                   |   7 |   7 |   7 |                           7 |                           7 | 7 $\pm$ 0                 |   7 |   7 |   7 |                     8 |                     8 | 8 $\pm$ 0           |   8 |   8 |   8 |                            8 |                            8 | 8 $\pm$ 0                  |   8 |   8 |   8 |                     8 |                     8 | 8 $\pm$ 0           |   8 |   8 |   8 |
| psr-small(50)            |                            48 |                            48 | 48 $\pm$ 0                  |  48 |  48 |  48 |                          48 |                          48 | 48 $\pm$ 0                |  48 |  48 |  48 |                    48 |                    48 | 48 $\pm$ 0          |  48 |  48 |  48 |                           48 |                           48 | 48 $\pm$ 0                 |  48 |  48 |  48 |                    48 |                    48 | 48 $\pm$ 0          |  48 |  48 |  48 |
| rovers(40)               |                             7 |                             7 | 7 $\pm$ 0                   |   7 |   7 |   7 |                           7 |                           7 | 7 $\pm$ 0                 |   7 |   7 |   7 |                     7 |                     7 | 7 $\pm$ 0           |   7 |   7 |   7 |                            7 |                            7 | 7 $\pm$ 0                  |   7 |   7 |   7 |                     7 |                     7 | 7 $\pm$ 0           |   7 |   7 |   7 |
| scanalyzer-opt11(20)     |                            10 |                            10 | 10 $\pm$ 0                  |  10 |  10 |  10 |                           8 |                          10 | 8.7 $\pm$ 0.6             |   9 |   8 |   9 |                    10 |                    10 | 10 $\pm$ 0          |  10 |  10 |  10 |                           10 |                           10 | 10 $\pm$ 0                 |  10 |  10 |  10 |                    10 |                    10 | 10 $\pm$ 0          |  10 |  10 |  10 |
| sokoban-opt11(20)        |                            17 |                            17 | 17 $\pm$ 0                  |  17 |  17 |  17 |                          17 |                          17 | 17 $\pm$ 0                |  17 |  17 |  17 |                    19 |                    19 | 19 $\pm$ 0          |  19 |  19 |  19 |                           19 |                           19 | 19 $\pm$ 0                 |  19 |  19 |  19 |                    19 |                    19 | 19 $\pm$ 0          |  19 |  19 |  19 |
| storage(30)              |                            14 |                            14 | 14 $\pm$ 0                  |  14 |  14 |  14 |                          14 |                          14 | 14 $\pm$ 0                |  14 |  14 |  14 |                    14 |                    14 | 14 $\pm$ 0          |  14 |  14 |  14 |                           14 |                           14 | 14 $\pm$ 0                 |  14 |  14 |  14 |                    15 |                    15 | 15 $\pm$ 0          |  15 |  15 |  15 |
| tidybot-opt11(20)        |                            11 |                            11 | 10.3 $\pm$ 0.6              |  11 |  10 |  10 |                          10 |                          11 | 10 $\pm$ 0                |  10 |  10 |  10 |                    11 |                    11 | 11 $\pm$ 0          |  11 |  11 |  11 |                           11 |                           11 | 11 $\pm$ 0                 |  11 |  11 |  11 |                    12 |                    12 | 12 $\pm$ 0          |  12 |  12 |  12 |
| tpp(30)                  |                             6 |                             6 | 6 $\pm$ 0                   |   6 |   6 |   6 |                           6 |                           6 | 6 $\pm$ 0                 |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |                            6 |                            6 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |
| transport-opt11(20)      |                             6 |                             6 | 6 $\pm$ 0                   |   6 |   6 |   6 |                           6 |                           6 | 6 $\pm$ 0                 |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |                            6 |                            6 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |
| visitall-opt11(20)       |                            10 |                            10 | 10 $\pm$ 0                  |  10 |  10 |  10 |                          10 |                          10 | 10 $\pm$ 0                |  10 |  10 |  10 |                    10 |                    10 | 10 $\pm$ 0          |  10 |  10 |  10 |                           10 |                           10 | 10 $\pm$ 0                 |  10 |  10 |  10 |                    10 |                    10 | 10 $\pm$ 0          |  10 |  10 |  10 |
| woodworking-opt11(20)    |                             9 |                             9 | 9 $\pm$ 0                   |   9 |   9 |   9 |                          11 |                           8 | 10 $\pm$ 1                |   9 |  10 |  11 |                    10 |                     9 | 11 $\pm$ 1          |  10 |  11 |  12 |                           10 |                            8 | 10.7 $\pm$ 1.5             |   9 |  11 |  12 |                    10 |                    10 | 10 $\pm$ 0          |  10 |  10 |  10 |
| zenotravel(20)           |                            11 |                            11 | 11 $\pm$ 0                  |  11 |  11 |  11 |                          11 |                          11 | 11 $\pm$ 0                |  11 |  11 |  11 |                    11 |                    11 | 11 $\pm$ 0          |  11 |  11 |  11 |                           11 |                           11 | 11 $\pm$ 0                 |  11 |  11 |  11 |                    11 |                    11 | 11 $\pm$ 0          |  11 |  11 |  11 |
#+TBLFM: $4=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1::$10=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1::$16=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1::$22=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1::$28=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1
